mszkowalik/SamplingScope/Firmware/Sampling_Scope.ioc
#MicroXplorer Configuration settings - do not modify
Mcu.Family=STM32H7
RCC.DIVQ2Freq_Value=96000000
PD7.Mode=Full_Duplex_Master
NVIC.OTG_HS_IRQn=true\:0\:0\:false\:false\:true\:false\:true
ProjectManager.MainLocation=Core/Src
PA15(JTDI).Locked=true
PH0-OSC_IN.Locked=true
PH0-OSC_IN.Signal=RCC_OSC_IN
SPI2.VirtualNSS=VM_NSSHARD
RCC.SAI1Freq_Value=110000000
VP_USB_DEVICE_VS_USB_DEVICE_CDC_HS.Mode=CDC_HS
RCC.CortexFreq_Value=550000000
SPI3.Direction=SPI_DIRECTION_2LINES
SPI4.VirtualType=VM_MASTER
SPI3.VirtualType=VM_MASTER
ProjectManager.KeepUserCode=true
Mcu.UserName=STM32H733ZGTx
SPI1.VirtualType=VM_MASTER
SPI2.VirtualType=VM_MASTER
PB10.Mode=Full_Duplex_Master
RCC.HPRE=RCC_HCLK_DIV2
PA15(JTDI).Signal=SPI3_NSS
PC10.Locked=true
PC10.Signal=SPI3_SCK
PC5.Locked=true
RCC.PLLFRACN=6144
SPI4.Direction=SPI_DIRECTION_2LINES
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-HAL-true,2-SystemClock_Config-RCC-false-HAL-false,3-MX_ADC1_Init-ADC1-false-HAL-true,4-MX_I2C1_Init-I2C1-false-HAL-true,5-MX_SPI1_Init-SPI1-false-HAL-true,6-MX_SPI2_Init-SPI2-false-HAL-true,7-MX_SPI3_Init-SPI3-false-HAL-true,8-MX_SPI4_Init-SPI4-false-HAL-true,10-MX_USB_DEVICE_Init-USB_DEVICE-false-HAL-false,0-MX_CORTEX_M7_Init-CORTEX_M7-false-HAL-true
PA13(JTMS/SWDIO).Signal=DEBUG_JTMS-SWDIO
PA11.Mode=Device_Only_FS
RCC.RTCFreq_Value=32000
PA14(JTCK/SWCLK).Locked=true
PA6.GPIO_Label=VREF2_FB
PB0.GPIO_Label=RT1
RCC.PLL2FRACN=0
RCC.CpuClockFreq_Value=550000000
RCC.VCO2OutputFreq_Value=192000000
SH.ADCx_INP5.0=ADC1_INP5,IN5-Single-Ended
PC1.Locked=true
PF12.GPIOParameters=GPIO_Label
PinOutPanel.RotationAngle=0
RCC.MCO1PinFreq_Value=64000000
RCC.SYSCLKSource=RCC_SYSCLKSOURCE_PLLCLK
ProjectManager.StackSize=0x400
RCC.AHB4Freq_Value=275000000
RCC.VCOInput3Freq_Value=750000
PA13(JTMS/SWDIO).Mode=Serial_Wire
RCC.LPTIM1Freq_Value=137500000
Mcu.IP4=NVIC
Mcu.IP5=RCC
Mcu.IP2=DEBUG
I2C1.IPParameters=Timing
NVIC.SVCall_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.IP3=I2C1
Mcu.IP0=ADC1
PA12.Locked=true
Mcu.IP1=CORTEX_M7
PA12.Signal=USB_OTG_HS_DP
Mcu.UserConstants=
SPI4.Mode=SPI_MODE_MASTER
PA4.Mode=NSS_Signal_Hard_Output
VP_USB_DEVICE_VS_USB_DEVICE_CDC_HS.Signal=USB_DEVICE_VS_USB_DEVICE_CDC_HS
RCC.DIVP3Freq_Value=48375000
RCC.SDMMCFreq_Value=110000000
Mcu.ThirdPartyNb=0
SPI1.Direction=SPI_DIRECTION_2LINES
SPI3.VirtualNSS=VM_NSSHARD
RCC.HCLKFreq_Value=275000000
RCC.I2C4Freq_Value=137500000
PE2.Mode=Full_Duplex_Master
Mcu.IPNb=13
ProjectManager.PreviousToolchain=
PB6.Signal=I2C1_SCL
RCC.SPDIFRXFreq_Value=110000000
PF11.GPIO_Label=PD_STEP_FB
PA13(JTMS/SWDIO).Locked=true
PF12.Signal=ADC1_INP6
PB6.Mode=I2C
RCC.DIVQ3Freq_Value=48375000
SPI1.CalculateBaudRate=55.0 MBits/s
Mcu.Pin6=PC1
Mcu.Pin7=PC2_C
PE5.Signal=SPI4_MISO
Mcu.Pin8=PA4
Mcu.Pin9=PA5
SPI4.IPParameters=VirtualType,Mode,Direction,CalculateBaudRate,VirtualNSS
PC2_C.Signal=SPI2_MISO
SH.ADCx_INP4.0=ADC1_INP4,IN4-Single-Ended
PH0-OSC_IN.Mode=HSE-External-Oscillator
Mcu.Pin0=PE2
Mcu.Pin1=PE4
GPIO.groupedBy=Group By Peripherals
Mcu.Pin2=PE5
Mcu.Pin3=PE6
Mcu.Pin4=PH0-OSC_IN
Mcu.Pin5=PH1-OSC_OUT
ADC1.Channel-0\#ChannelRegularConversion=ADC_CHANNEL_2
ProjectManager.ProjectBuild=false
RCC.DIVR3Freq_Value=48375000
RCC.HSE_VALUE=24000000
NVIC.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
NVIC.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PB2.Signal=SPI3_MOSI
PA4.Locked=true
Mcu.IP10=SYS
RCC.DIVM2=2
NVIC.SysTick_IRQn=true\:0\:0\:false\:false\:true\:false\:true
RCC.DIVM1=3
Mcu.IP12=USB_OTG_HS
Mcu.IP11=USB_DEVICE
ProjectManager.FirmwarePackage=STM32Cube FW_H7 V1.8.0
MxDb.Version=DB.6.0.10
PF12.GPIO_Label=RT0
PB0.GPIOParameters=GPIO_Label
RCC.DIVP1Freq_Value=550000000
ProjectManager.BackupPrevious=false
RCC.FMCFreq_Value=275000000
PC4.GPIO_Label=VREF1_FB
PB1.GPIO_Label=PD_MAIN_FB
PF11.Signal=ADC1_INP2
RCC.USART16Freq_Value=137500000
File.Version=6
SPI2.CalculateBaudRate=55.0 MBits/s
PH1-OSC_OUT.Locked=true
PE2.Signal=SPI4_SCK
PB7.Signal=I2C1_SDA
SPI1.VirtualNSS=VM_NSSHARD
NVIC.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PE4.Mode=NSS_Signal_Hard_Output
USB_OTG_HS.IPParameters=VirtualMode-Device_Only_FS
PF11.GPIOParameters=GPIO_Label
RCC.DIVR2Freq_Value=96000000
PE4.Signal=SPI4_NSS
ProjectManager.HalAssertFull=false
PB0.Locked=true
ADC1.SamplingTime-0\#ChannelRegularConversion=ADC_SAMPLETIME_1CYCLE_5
RCC.DIVP2Freq_Value=96000000
SH.ADCx_INP3.0=ADC1_INP3,IN3-Single-Ended
PC2_C.Locked=true
ProjectManager.ProjectName=Sampling_Scope
SH.ADCx_INP4.ConfNb=1
RCC.APB3Freq_Value=137500000
PH1-OSC_OUT.Mode=HSE-External-Oscillator
RCC.MCO2PinFreq_Value=550000000
Mcu.Package=LQFP144
PB1.Signal=ADCx_INP5
PA6.Signal=ADCx_INP3
PB12.Mode=NSS_Signal_Hard_Output
PA7.Locked=true
PA5.Locked=true
SPI2.Mode=SPI_MODE_MASTER
RCC.PLL3FRACN=0
RCC.D1PPRE=RCC_APB3_DIV2
SPI3.Mode=SPI_MODE_MASTER
RCC.EnbaleCSS=true
ProjectManager.ToolChainLocation=
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
USB_DEVICE.CLASS_NAME_HS=CDC
RCC.DFSDMFreq_Value=137500000
RCC.DIVR1Freq_Value=275000000
PC11.Mode=Full_Duplex_Master
USB_DEVICE.VirtualModeHS=Cdc_HS
RCC.TraceFreq_Value=275000000
RCC.APB4Freq_Value=137500000
RCC.CECFreq_Value=32000
NVIC.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PC4.Locked=true
RCC.LPUART1Freq_Value=137500000
SPI3.IPParameters=VirtualType,Mode,Direction,CalculateBaudRate,VirtualNSS
SPI2.Direction=SPI_DIRECTION_2LINES
PC5.Signal=ADCx_INP8
PE6.Locked=true
SH.ADCx_INP7.ConfNb=1
ProjectManager.CustomerFirmwarePackage=
PC4.GPIOParameters=GPIO_Label
RCC.Tim2OutputFreq_Value=275000000
RCC.DFSDMACLkFreq_Value=110000000
RCC.VCO3OutputFreq_Value=96750000
PA5.Mode=Full_Duplex_Master
PA6.GPIOParameters=GPIO_Label
RCC.PLLSourceVirtual=RCC_PLLSOURCE_HSE
ProjectManager.ProjectFileName=Sampling_Scope.ioc
RCC.DIVQ1=5
ADC1.Rank-0\#ChannelRegularConversion=1
Mcu.PinsNb=34
ProjectManager.NoMain=false
PC11.Locked=true
SPI1.IPParameters=VirtualType,Mode,Direction,CalculateBaudRate,VirtualNSS
ADC1.IPParameters=Rank-0\#ChannelRegularConversion,Channel-0\#ChannelRegularConversion,SamplingTime-0\#ChannelRegularConversion,OffsetNumber-0\#ChannelRegularConversion,OffsetSignedSaturation-0\#ChannelRegularConversion,NbrOfConversionFlag,master
PG9.Locked=true
ADC1.OffsetNumber-0\#ChannelRegularConversion=ADC_OFFSET_NONE
PG9.Signal=SPI1_MISO
PC11.Signal=SPI3_MISO
RCC.SWPMI1Freq_Value=137500000
RCC.SAI4BFreq_Value=110000000
PG9.Mode=Full_Duplex_Master
PC4.Signal=ADCx_INP4
PC10.Mode=Full_Duplex_Master
PD7.Signal=SPI1_MOSI
RCC.D2PPRE2=RCC_APB2_DIV2
RCC.D2PPRE1=RCC_APB1_DIV2
ProjectManager.DefaultFWLocation=true
RCC.DIVP1=1
PB12.Locked=true
ProjectManager.DeletePrevious=true
PB10.Locked=true
RCC.QSPIFreq_Value=275000000
SH.ADCx_INP9.0=ADC1_INP9,IN9-Single-Ended
USB_DEVICE.IPParameters=VirtualMode,VirtualModeHS,CLASS_NAME_HS
USB_OTG_HS.VirtualMode-Device_Only_FS=Device_Only_FS
RCC.FamilyName=M
RCC.SPI6Freq_Value=137500000
RCC.D1CPREFreq_Value=550000000
SH.ADCx_INP9.ConfNb=1
PF11.Mode=IN2-Single-Ended
RCC.USART234578Freq_Value=137500000
PA11.Locked=true
RCC.SPI45Freq_Value=137500000
RCC.Tim1OutputFreq_Value=275000000
RCC.SPI123Freq_Value=110000000
ProjectManager.TargetToolchain=STM32CubeIDE
RCC.VCO1OutputFreq_Value=550000000
PC5.GPIOParameters=GPIO_Label
RCC.AXIClockFreq_Value=275000000
RCC.DIVN2=16
I2C1.Timing=0x60404E72
RCC.DIVN1=68
PE4.Locked=true
PC2_C.Mode=Full_Duplex_Master
SPI2.IPParameters=VirtualType,Mode,Direction,CalculateBaudRate,VirtualNSS
ProjectManager.RegisterCallBack=
RCC.USBFreq_Value=48000000
SPI4.VirtualNSS=VM_NSSHARD
PD7.Locked=true
RCC.CKPERFreq_Value=64000000
PB1.Locked=true
ADC1.OffsetSignedSaturation-0\#ChannelRegularConversion=DISABLE
SH.ADCx_INP8.0=ADC1_INP8,IN8-Single-Ended
PB10.Signal=SPI2_SCK
SH.ADCx_INP5.ConfNb=1
RCC.USBCLockSelection=RCC_USBCLKSOURCE_HSI48
PA5.Signal=SPI1_SCK
board=custom
ProjectManager.LastFirmware=true
RCC.VCOInput1Freq_Value=8000000
RCC.AHB12Freq_Value=275000000
RCC.APB2Freq_Value=137500000
SPI3.CalculateBaudRate=55.0 MBits/s
PE6.Mode=Full_Duplex_Master
MxCube.Version=6.1.1
SPI1.Mode=SPI_MODE_MASTER
RCC.FDCANFreq_Value=110000000
RCC.RNGFreq_Value=48000000
PE5.Mode=Full_Duplex_Master
Mcu.Pin30=PB6
RCC.ADCFreq_Value=96000000
VP_SYS_VS_Systick.Mode=SysTick
PF11.Locked=true
PF12.Locked=true
Mcu.Pin33=VP_USB_DEVICE_VS_USB_DEVICE_CDC_HS
PH1-OSC_OUT.Signal=RCC_OSC_OUT
Mcu.Pin31=PB7
Mcu.Pin32=VP_SYS_VS_Systick
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:true
SPI4.CalculateBaudRate=68.75 MBits/s
PE5.Locked=true
PE6.Signal=SPI4_MOSI
PA14(JTCK/SWCLK).Mode=Serial_Wire
ProjectManager.FreePins=false
RCC.IPParameters=ADCFreq_Value,AHB12Freq_Value,AHB4Freq_Value,APB1Freq_Value,APB2Freq_Value,APB3Freq_Value,APB4Freq_Value,AXIClockFreq_Value,CECFreq_Value,CKPERFreq_Value,CortexFreq_Value,CpuClockFreq_Value,D1CPREFreq_Value,D1PPRE,D2PPRE1,D2PPRE2,D3PPRE,DFSDMACLkFreq_Value,DFSDMFreq_Value,DIVM1,DIVM2,DIVN1,DIVN2,DIVP1,DIVP1Freq_Value,DIVP2Freq_Value,DIVP3Freq_Value,DIVQ1,DIVQ1Freq_Value,DIVQ2Freq_Value,DIVQ3Freq_Value,DIVR1Freq_Value,DIVR2Freq_Value,DIVR3Freq_Value,EnbaleCSS,FDCANFreq_Value,FMCFreq_Value,FamilyName,HCLK3ClockFreq_Value,HCLKFreq_Value,HPRE,HSE_VALUE,I2C123Freq_Value,I2C4Freq_Value,LPTIM1Freq_Value,LPTIM2Freq_Value,LPTIM345Freq_Value,LPUART1Freq_Value,LTDCFreq_Value,MCO1PinFreq_Value,MCO2PinFreq_Value,PLL2FRACN,PLL3FRACN,PLLFRACN,PLLSourceVirtual,QSPIFreq_Value,RNGFreq_Value,RTCFreq_Value,SAI1Freq_Value,SAI4AFreq_Value,SAI4BFreq_Value,SDMMCFreq_Value,SPDIFRXFreq_Value,SPI123Freq_Value,SPI45Freq_Value,SPI6Freq_Value,SWPMI1Freq_Value,SYSCLKFreq_VALUE,SYSCLKSource,Tim1OutputFreq_Value,Tim2OutputFreq_Value,TraceFreq_Value,USART16Freq_Value,USART234578Freq_Value,USBCLockSelection,USBFreq_Value,VCO1OutputFreq_Value,VCO2OutputFreq_Value,VCO3OutputFreq_Value,VCOInput1Freq_Value,VCOInput2Freq_Value,VCOInput3Freq_Value
ProjectManager.AskForMigrate=true
Mcu.Name=STM32H733ZGTx
RCC.LPTIM2Freq_Value=137500000
Mcu.Pin26=PC10
Mcu.Pin27=PC11
Mcu.Pin24=PA14(JTCK/SWCLK)
ProjectManager.UnderRoot=true
Mcu.Pin25=PA15(JTDI)
PB2.Locked=true
Mcu.IP8=SPI3
SH.ADCx_INP7.0=ADC1_INP7,IN7-Single-Ended
SH.ADCx_INP8.ConfNb=1
Mcu.IP9=SPI4
Mcu.Pin28=PD7
Mcu.IP6=SPI1
Mcu.Pin29=PG9
Mcu.IP7=SPI2
ProjectManager.CoupleFile=false
PA4.Signal=SPI1_NSS
RCC.SYSCLKFreq_VALUE=550000000
Mcu.Pin22=PA12
RCC.I2C123Freq_Value=137500000
Mcu.Pin23=PA13(JTMS/SWDIO)
PA7.GPIO_Label=RT3
Mcu.Pin20=PB12
ADC1.master=1
PF12.Mode=IN6-Single-Ended
Mcu.Pin21=PA11
PA12.Mode=Device_Only_FS
NVIC.ForceEnableDMAVector=true
KeepUserPlacement=false
PC5.GPIO_Label=RT2
NVIC.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PB2.Mode=Full_Duplex_Master
ProjectManager.CompilerOptimize=6
PB7.Mode=I2C
PA11.Signal=USB_OTG_HS_DM
ProjectManager.HeapSize=0x200
Mcu.Pin15=PB1
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.Pin16=PB2
Mcu.Pin13=PC5
Mcu.Pin14=PB0
Mcu.Pin19=PB10
RCC.LPTIM345Freq_Value=137500000
ProjectManager.ComputerToolchain=false
Mcu.Pin17=PF11
Mcu.Pin18=PF12
RCC.LTDCFreq_Value=48375000
RCC.SAI4AFreq_Value=110000000
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_4
ADC1.NbrOfConversionFlag=1
Mcu.Pin11=PA7
Mcu.Pin12=PC4
Mcu.Pin10=PA6
RCC.DIVQ1Freq_Value=110000000
PE2.Locked=true
RCC.D3PPRE=RCC_APB4_DIV2
PA14(JTCK/SWCLK).Signal=DEBUG_JTCK-SWCLK
PA15(JTDI).Mode=NSS_Signal_Hard_Output
SH.ADCx_INP3.ConfNb=1
RCC.HCLK3ClockFreq_Value=275000000
RCC.VCOInput2Freq_Value=12000000
RCC.APB1Freq_Value=137500000
PB0.Signal=ADCx_INP9
USB_DEVICE.VirtualMode=Cdc
PA7.GPIOParameters=GPIO_Label
ProjectManager.DeviceId=STM32H733ZGTx
PC1.Signal=SPI2_MOSI
PB12.Signal=SPI2_NSS
ProjectManager.LibraryCopy=1
PC1.Mode=Full_Duplex_Master
PB1.GPIOParameters=GPIO_Label
PA7.Signal=ADCx_INP7
PA6.Locked=true
isbadioc=false
